***messages***

:STRINGS

; These are strings for prompts proposing users to choose from several
; options defined by words. Every such word is started from _.
; In every word the first character not used yet by previous words
; is assigned as hotkey. It is necessary to make such character
; uppercase, so users will know what to enter for every choice.
MYesNo                         "_Y-是_N-否"
MYesNoAll                      "_Y-是_N-否_A-全部"
MYesNoAllQ                     "_Y-是_N-否_A-全部_E-从不_Q-退出"
MYesNoAllRenQ                  "_Y-是_N-否_A-全部_E-从不_R-重命名_Q-退出"
MContinueQuit                  "_C-继续_Q-退出"
MRetryAbort                    "_R-重试_A-中止"
MIgnoreAllRetryQuit            "_忽略_忽略 全部_重试_退出"

MCopyright                     "\nRAR %s   版权所有 (c) 1993-%d Alexander Roshal   %d %.3s %d"
MRegTo                         "\n已注册给 %s\n"
MShare                         "\n试用版             输入“rar -?”获得帮助\n"
MRegKeyWarning                 "\n可用的许可证密钥仅对 %s 有效\n"
MUCopyright                    "\nUNRAR %s 免费软件      版权所有 (c) 1993-%d Alexander Roshal\n"
MBeta                          "beta"
Mx86                           "x86"
Mx64                           "x64"
MMonthJan                      "一月"
MMonthFeb                      "二月"
MMonthMar                      "三月"
MMonthApr                      "四月"
MMonthMay                      "五月"
MMonthJun                      "六月"
MMonthJul                      "七月"
MMonthAug                      "八月"
MMonthSep                      "九月"
MMonthOct                      "十月"
MMonthNov                      "十一月"
MMonthDec                      "十二月"
MWeekDayMon                    "星期一"
MWeekDayTue                    "星期二"
MWeekDayWed                    "星期三"
MWeekDayThu                    "星期四"
MWeekDayFri                    "星期五"
MWeekDaySat                    "星期六"
MWeekDaySun                    "星期天"
MRARTitle1                     "\n用法:     rar <command> -<switch 1> -<switch N> <archive> <files...>"
MUNRARTitle1                   "\n用法:     unrar <command> -<switch 1> -<switch N> <archive> <files...>"
MRARTitle2                     "\n               <@listfiles...> <path_to_extract\\>"
MFwrSlTitle2                   "\n               <@listfiles...> <path_to_extract/>"
MCHelpCmd                      "\n\n<Commands>"
MCHelpCmdA                     "\n  a             添加文件到压缩文件"
MCHelpCmdC                     "\n  c             添加压缩文档注释"
MCHelpCmdCH                    "\n  ch            更改压缩文档参数"
MCHelpCmdCW                    "\n  cw            写入压缩文档注释到文件"
MCHelpCmdD                     "\n  d             从压缩文档删除文件"
MCHelpCmdE                     "\n  e             提取文件不带压缩路径"
MCHelpCmdF                     "\n  f             刷新压缩文档中的文件"
MCHelpCmdI                     "\n  i[par]=<str>  在压缩文档里查找字符串"
MCHelpCmdK                     "\n  k             锁定压缩文档"
MCHelpCmdL                     "\n  l[t[a],b]     列出压缩文档内容 [technical[all], bare]"
MCHelpCmdM                     "\n  m[f]          移动到压缩文档 [files only]"
MCHelpCmdP                     "\n  p             打印文件到 stdout"
MCHelpCmdR                     "\n  r             修复压缩文档"
MCHelpCmdRC                    "\n  rc            重新构建丢失的卷"
MCHelpCmdRN                    "\n  rn            重命名归档的文件"
MCHelpCmdRR                    "\n  rr[N]         添加数据恢复记录"
MCHelpCmdRV                    "\n  rv[N]         创建恢复卷"
MCHelpCmdS                     "\n  s[name|-]     转换压缩文档到或从 SFX"
MCHelpCmdT                     "\n  t             测试压缩文档的文件"
MCHelpCmdU                     "\n  u             更新压缩文档中的文件"
MCHelpCmdV                     "\n  v[t[a],b]     详细列出压缩文档的内容 [technical[all],bare]"
MCHelpCmdX                     "\n  x             解压文件带完整路径"
MCHelpSw                       "\n\n<Switches>"
MCHelpSwm                      "\n  -             停止参数扫描"
MCHelpSwAT                     "\n  @[+]          禁用 [enable] 文件列表"
MCHelpSwAC                     "\n  ac            压缩或解压后清除压缩文档属性"
MCHelpSwAD                     "\n  ad[1,2]       备选目标路径"
MCHelpSwAG                     "\n  ag[format]    使用当前日期生成压缩文档名称"
MCHelpSwAI                     "\n  ai            忽略文件属性"
MCHelpSwAM                     "\n  am[s,r]       压缩文件名称和时间 [save, restore]"
MCHelpSwAO                     "\n  ao            添加文件带有压缩文档属性集"
MCHelpSwAP                     "\n  ap<path>      设置压缩文档内部的路径"
MCHelpSwAS                     "\n  as            同步压缩文档内容"
MCHelpSwCm                     "\n  c-            禁用注释显示"
MCHelpSwCFGm                   "\n  cfg-          禁用读取配置"
MCHelpSwCL                     "\n  cl            转换名称为小写"
MCHelpSwCU                     "\n  cu            转换名称为大写"
MCHelpSwDF                     "\n  df            压缩后删除文件"
MCHelpSwDH                     "\n  dh            打开共享的文件"
MCHelpSwDR                     "\n  dr            删除文件到回收站"
MCHelpSwDS                     "\n  ds            为固实压缩禁用名称排序"
MCHelpSwDW                     "\n  dw            压缩后删除文件"
MCHelpSwEa                     "\n  e[+]<attr>    设置文件排除和包含属性"
MCHelpSwED                     "\n  ed            不要添加空目录"
MCHelpSwEP                     "\n  ep            从名称里排除路径"
MCHelpSwEP1                    "\n  ep1           从名称里排除根目录"
MCHelpSwEP2                    "\n  ep2           扩展路径为完整路径"
MCHelpSwEP3                    "\n  ep3           扩展路径为完整路径包括驱动器盘符"
MCHelpSwEP4                    "\n  ep4<path>     从名称中排除路径前缀"
MCHelpSwF                      "\n  f             刷新文件"
MCHelpSwHP                     "\n  hp[password]  加密文件数据及文件头"
MCHelpSwHT                     "\n  ht[b|c]       选择哈希类型 [BLAKE2,CRC32] 用于文件校验和"
MCHelpSwIDP                    "\n  id[c,d,n,p,q] 显示或禁用消息"
MCHelpSwIEML                   "\n  ieml[addr]    通过电邮发送压缩文档"
MCHelpSwIERR                   "\n  ierr          发送所有消息到 stderr"
MCHelpSwILOG                   "\n  ilog[name]    记录错误日志到文件"
MCHelpSwINUL                   "\n  inul          禁用所有消息"
MCHelpSwIOFF                   "\n  ioff[n]       完成一个操作后关闭电脑"
MCHelpSwISND                   "\n  isnd[-]       控制通知声音"
MCHelpSwIVER                   "\n  iver          显示版本号"
MCHelpSwK                      "\n  k             锁定压缩文档"
MCHelpSwKB                     "\n  kb            保留损坏的已解压文件"
MCHelpSwLog                    "\n  log[f][=name] 将名称写入日志文件"
MCHelpSwMn                     "\n  m<0..5>       设置压缩等级 (0-store...3-default...5-maximal)"
MCHelpSwMC                     "\n  mc<par>       设置高级压缩参数"
MCHelpSwMD                     "\n  md[x]<n>[kmg] 词典大小单位为 KB, MB 或 GB"
MCHelpSwME                     "\n  me[par]       设置加密参数"
MCHelpSwMLP                    "\n  mlp           使用大内存页面"
MCHelpSwMS                     "\n  ms[ext;ext]   指定要存储的文件类型"
MCHelpSwMT                     "\n  mt<threads>   设置线程数"
MCHelpSwN                      "\n  n<file>       额外过滤器包含文件"
MCHelpSwNa                     "\n  n@            从 stdin 读取额外的过滤器掩码"
MCHelpSwNal                    "\n  n@<list>      从列表文件读取额外的过滤器掩码"
MCHelpSwO                      "\n  o[+|-]        设置覆盖模式"
MCHelpSwOC                     "\n  oc            设置 NTFS 压缩属性"
MCHelpSwOH                     "\n  oh            保存硬链接为链接而不是文件"
MCHelpSwOI                     "\n  oi[0-4][:min] 将相同的文件保存为参考"
MCHelpSwOL                     "\n  ol[a,-]       将符号链接处理为链接 [absolute paths, skip]"
MCHelpSwOM                     "\n  om[-|1][=lst] 传送 Mark of the Web"
MCHelpSwONI                    "\n  oni           允许潜在的不兼容名称"
MCHelpSwOP                     "\n  op<path>      设置解压文件的输出路径"
MCHelpSwOR                     "\n  or            自动重命名文件"
MCHelpSwOS                     "\n  os            保存 NTFS 流"
MCHelpSwOW                     "\n  ow            保存或恢复文件拥有者和组"
MCHelpSwP                      "\n  p[password]   设置密码"
MCHelpSwQO                     "\n  qo[-|+]       添加快速打开信息 [none|force]"
MCHelpSwR                      "\n  r             递归子目录"
MCHelpSwRm                     "\n  r-            禁用递归"
MCHelpSwR0                     "\n  r0            递归子目录仅用于通配符名称"
MCHelpSwRI                     "\n  ri<P>[:<S>]   设置优先级 (0-默认,1-最小值.15-最大值) 和休眠时间单位为 ms"
MCHelpSwRR                     "\n  rr[N]         添加数据恢复记录"
MCHelpSwRV                     "\n  rv[N]         创建恢复卷"
MCHelpSwS                      "\n  s[=<par>]     创建固实压缩文档"
MCHelpSwSC                     "\n  sc<chr>[obj]  指定字符集"
MCHelpSwSFX                    "\n  sfx[name]     创建 SFX 压缩文档"
MCHelpSwSI                     "\n  si[name]      从标准输入读取数据 (stdin)"
MCHelpSwSL                     "\n  sl<size>[u]   处理小于指定大小的文件"
MCHelpSwSM                     "\n  sm<size>[u]   处理大于指定大小的文件"
MCHelpSwT                      "\n  t             压缩后测试"
MCHelpSwTK                     "\n  tk[<date>]    保留原来的压缩时间或设置指定的归档时间"
MCHelpSwTL                     "\n  tl            设置压缩时间到最近的文件"
MCHelpSwTN                     "\n  tn[mcao]<t>   处理那些时间比 <t> 更新的文件"
MCHelpSwTO                     "\n  to[mcao]<t>   处理那些时间比 <t> 更旧的文件"
MCHelpSwTA                     "\n  ta[mcao]<d>   处理那些在日期 <d> YYYYMMDDHHMMSS 之后修改过的文件"
MCHelpSwTB                     "\n  tb[mcao]<d>   处理那些在日期 <d> YYYYMMDDHHMMSS 之前修改过的文件"
MCHelpSwTS                     "\n  ts[m,c,a,p]   保存或恢复时间（修改日期，创建日期，访问日期，保留日期）"
MCHelpSwU                      "\n  u             更新文件"
MCHelpSwV                      "\n  v             创建卷并自动检测大小或列出所有卷"
MCHelpSwVUnr                   "\n  v             列出所有卷"
MCHelpSwVn                     "\n  v<size>[u]    以 [bBkKmMgGtT] 为单位大小创建卷"
MCHelpSwVD                     "\n  vd            创建卷之前删除磁盘内容"
MCHelpSwVER                    "\n  ver[n]        文件版本控制"
MCHelpSwVP                     "\n  vp            每个卷之前暂停"
MCHelpSwW                      "\n  w<path>       指定工作目录"
MCHelpSwX                      "\n  x<file>       排除指定文件"
MCHelpSwXa                     "\n  x@            读取文件名以便从 stdin 排除"
MCHelpSwXal                    "\n  x@<list>      排除在指定列表文件里列出的文件"
MCHelpSwY                      "\n  y             对所有查询假设是"
MCHelpSwZ                      "\n  z[file]       从文件读取压缩文档注释"
MBadArc                        "\n错误: 损坏的压缩文件 %s\n"
MAskPsw                        "输入密码 (不会显示)"
MAskPswFor                     "\n输入密码 (不会显示) 给 %s: "
MReAskPsw                      "\n再次输入密码: "
MNotMatchPsw                   "\n错误: 密码不匹配\n"
MErrWrite                      "写入错误到文件 %s"
MErrRead                       "在文件 %s 里读取错误"
MErrSeek                       "在文件里 %s 查找错误"
MErrFClose                     "无法关闭文件 %s"
MErrOutMem                     "内存不足"
MErrBrokenArc                  "损坏的压缩文件 - 请使用“Repair”命令"
MProgAborted                   "程序终止"
MErrRename                     "\n无法重命名 %s 为 %s"
MAbsNextVol                    "\n无法找到卷 %s"
MBreak                         "\n用户中断\n"
MAskCreatVol                   "\n是否创建下一个卷?"
MAskNextDisk                   "\n磁盘已满。插入下一张盘"
MCreatVol                      "\n\n正在创建 %sarchive %s\n"
MAskNextVol                    "\n插入磁盘带有 %s"
MTestVol                       "\n\n正在测试压缩文件 %s\n"
MExtrVol                       "\n\n正在从 %s 解压\n"
MConverting                    "\n正在转换 %s"
MCvtToSFX                      "\n转换压缩文件为 SFX"
MCvtFromSFX                    "\n正在删除 SFX 模块"
MNotSFX                        "\n%s 不是 SFX 压缩文件"
MNotRAR                        "\n%s 不是 RAR 压缩文件"
MNotFirstVol                   "\n%s 不是第一个卷"
MCvtOldFormat                  "\n%s - 无法转换为带有旧格式的 SFX 压缩文件"
MCannotCreate                  "\n无法创建 %s"
MCannotOpen                    "\n无法打开 %s"
MUnknownMeth                   "\n未知的方法在 %s"
MNewRarFormat                  "\n不支持的压缩文件格式。请更新 RAR 到更新的版本。"
MOk                            " 确定"
MDone                          "\n已完成"
MLockingArc                    "\n正在锁定压缩文件"
MNotMdfOld                     "\n\n错误: 无法修改旧格式的压缩文件"
MNotMdfLock                    "\n\n错误: 已锁定的压缩文件"
MNotMdfVol                     "\n\n错误: 无法修改卷"
MPackAskReg                    "\n评估版本。请注册。\n"
MCreateArchive                 "\n正在创建 %sarchive %s\n"
MUpdateArchive                 "\n正在更新 %sarchive %s\n"
MAddSolid                      "固实 "
MAddFile                       "\n正在添加    %-58s     "
MUpdFile                       "\n正在更新  %-58s     "
MAddPoints                     "\n...       %-58s     "
MMoveDelFiles                  "\n\n正在删除文件 %s..."
MMoveDelDirs                   "和目录"
MMoveDelFile                   "\n正在删除 %-30s"
MMoveDeleted                   "    已删除"
MMoveNotDeleted                "    未删除"
MClearAttrib                   "\n\n正在清除属性..."
MMoveDelDir                    "\n正在删除目录 %-30s"
MWarErrFOpen                   "\n警告: 无法打开 %d %s"
MErrOpenFiles                  "文件"
MErrOpenFile                   "文件"
MAddNoFiles                    "\n警告: 没有文件"
MMdfEncrSol                    "\n%s: 已加密"
MAddAnalyze                    "\n正在分析压缩文件:"
MRepacking                     "\n正在重新打包压缩文件: "
MCRCFailed                     "\n%-20s - 校验和错误"
MExtrTest                      "\n正在测试压缩文件 %s\n"
MExtracting                    "\n正在从 %s 解压\n"
MUseCurPsw                     "\n%s - 使用当前的密码?"
MCreatDir                      "\n正在创建    %-56s"
MExtrSkipFile                  "\n正在忽略    %-56s"
MExtrTestFile                  "\n正在测试     %-56s"
MExtrFile                      "\n正在解压  %-56s"
MExtrPoints                    "\n...         %-56s"
MExtrErrMkDir                  "\n无法创建目录 %s"
MExtrPrinting                  "\n------ 正在打印 %s\n\n"
MEncrBadCRC                    "\n在加密文件 %s 里存在校验和错误。文件已损坏或密码错误。"
MExtrNoFiles                   "\n没有文件可解压"
MExtrAllOk                     "\n全部正常"
MExtrTotalErr                  "\n全部错误: %ld"
MAskReplace                    "\n\n您是否希望替换现有的文件 %s\n%6s 字节, 已修改 %s\n为一个新的\n%6s 字节, 已修改 %s\n"
MAskOverwrite                  "\n覆盖 %s?"
MAskNewName                    "\n输入新名称: "
MHeaderBroken                  "\n发现已损坏的文件头"
MMainHeaderBroken              "\n主压缩文件头已损坏"
MLogFileHead                   "\n%s - 该文件头已损坏"
MLogProtectHead                "数据恢复报头已损坏"
MArcComment                    "\n压缩文件注释"
MReadStdinCmt                  "\n从 stdin 读取注释\n"
MReadCommFrom                  "\n从 %s 读取注释"
MDelComment                    "\n从 %s 删除注释"
MAddComment                    "\n添加注释到 %s"
MLogCommBrk                    "\n压缩文件注释已损坏"
MCommAskCont                   "\n请按“回车”继续或按“Q”退出:"
MWriteCommTo                   "\n写入注释到 %s"
MCommNotPres                   "\n注释不存在"
MDelFrom                       "\n正在从 %s 删除"
MDeleting                      "\n正在删除 %s"
MEraseArc                      "\n正在删除空的压缩文件 %s"
MNoDelFiles                    "\n没有要删除的文件"
MLogTitle                      "--------  %2d %s %d, 压缩文件 %s"
MPathTooLong                   "\n错误: 路径太长\n"
MListArchive                   "压缩文件"
MListDetails                   "详细信息"
MListSolid                     "固实"
MListSFX                       "SFX"
MListVolume                    "卷"
MListRR                        "恢复记录"
MListLock                      "锁定"
MListEnc                       "已加密"
MListEncHead                   "已加密的报头"

; Titles for 'L' and 'V' commands.
MListTitleL                    " 属性       大小     日期    时间   名称"
MListTitleV                    " 属性       大小     压缩比例    日期    时间   校验和  名称"

; Titles for multiline list output.
MListName                      "名称"
MListType                      "类型"
MListFile                      "文件"
MListDir                       "目录"
MListUSymlink                  "Unix 符号链接"
MListWSymlink                  "Windows 符号链接"
MListJunction                  "NTFS 连接点"
MListHardlink                  "硬链接"
MListCopy                      "文件引用"
MListStream                    "NTFS 交替数据流"
MListTarget                    "目标"
MListSize                      "大小"
MListPacked                    "打包大小"
MListRatio                     "压缩率"
MListMtime                     "mtime"
MListCtime                     "ctime"
MListAtime                     "atime"
MListModified                  "已修改"
MListCreated                   "已创建"
MListAccessed                  "已访问"
MListAttr                      "属性"
MListFlags                     "旗标"
MListCompInfo                  "压缩"
MListHostOS                    "压缩平台"
MListFileVer                   "文件版本"
MListService                   "服务"
MListNTACLHead                 "\n   NTFS 安全数据"
MListStrmHead                  "\n   NTFS 流: %s"
MListUnkHead                   "\n   未知的子报头类型: 0x%04x"
MYes                           "是"
MNo                            "否"
MListNoFiles                   "  0 文件\n"
MRprReconstr                   "\n正在重建 %s"
MRprBuild                      "\n正在构建 %s"
MRprOldFormat                  "\n无法修复旧格式的压缩文件"
MRprFind                       "\n已找到  %s"
MRprAskIsSol                   "\n压缩报头已损坏。将压缩文件标记为固实?"
MRprNoFiles                    "\n未找到任何文件"
MLogUnexpEOF                   "\n意外的压缩文件末尾"
MRepAskReconst                 "\n重建压缩文件结构?"
MRRSearch                      "\n正在搜索恢复记录"
MAnalyzeFileData               "\n正在分析文件数据"
MRecRNotFound                  "\n未找到数据恢复记录"
MRecRFound                     "\n已找到数据恢复记录"
MRecSecDamage                  "\n扇区 %ld (偏移 %lX...%lX) 已损坏"
MRecCorrected                  " - 数据已恢复"
MRecFailed                     " - 无法恢复数据"
MAddRecRec                     "\n正在添加数据恢复记录"
MEraseForVolume                "\n\n正在删除驱动器 %c 的内容:\n"
MGetOwnersError                "\n警告: 无法获得 %s 拥有者和组\n"
MErrGetOwnerID                 "\n警告: 无法获得拥有者 %s ID\n"
MErrGetGroupID                 "\n警告: 无法获得组 %s ID\n"
MOwnersBroken                  "\n错误: %s 组和拥有者数据已损坏\n"
MSetOwnersError                "\n警告: 无法设置 %s 拥有者和组\n"
MErrLnkRead                    "\n警告: 无法读取符号链接 %s"
MSymLinkExists                 "\n警告: 符号链接 %s 已存在"
MAskRetryCreate                "\n无法创建 %s。重试?"
MDataBadCRC                    "\n%-20s : 压缩的数据校验和错误出现在卷 %s 里"
MFileRO                        "\n%s 为只读"
MACLGetError                   "\n警告: 无法获取 %s 安全数据\n"
MACLSetError                   "\n警告: 无法设置 %s 安全数据\n"
MACLBroken                     "\n错误: %s 安全数据已损坏\n"
MACLUnknown                    "\n警告: 未知格式的 %s 安全数据\n"
MStreamBroken                  "\n错误: %s 流数据已损坏\n"
MStreamUnknown                 "\n警告: 未知格式的 %s 流数据\n"
MInvalidName                   "\n错误: 无效的文件名 %s"
MProcessArc                    "\n正在处理压缩文件 %s"
MCorrectingName                "\n警告: 正在尝试更正无效文件或目录名称"
MUnpCannotMerge                "\n警告: 您需要从上一个卷启动解压来解压缩 %s"
MUnknownOption                 "\n错误: 未知选项: %s"
MSwSyntaxError                 "\n错误: '-' 被期望位于以下值的开头: %s"
MSubHeadCorrupt                "\n错误: 找到已损坏的数据报头, 已忽略"
MSubHeadUnknown                "\n警告: 未知的数据报头格式, 已忽略"
MSubHeadDataCRC                "\n错误: 损坏的 %s 数据块"
MScanError                     "\n无法读取 %s 的内容"
MNotVolume                     "\n%s 不是卷"
MRecVolDiffSets                "\n错误: %s 和 %s 属于不同的设置"
MRecVolMissing                 "\n%d 卷丢失"
MRecVolFound                   "\n%d 恢复卷已找到"
MRecVolAllExist                "\n没有什么可以重建"
MRecVolCannotFix               "\n无法重建"
MReconstructing                "\n正在重建..."
MCreating                      "\n正在创建 %s"
MRenaming                      "\n正在重命名 %s 为 %s"
MNTFSRequired                  "\n写入错误: 仅 NTFS 文件系统支持大于 4 GB 的文件"
MFAT32Size                     "\n警告: FAT32 文件系统不支持大于 4 GB 的文件"
MErrChangeAttr                 "\n警告: 无法更改 %s 的属性"
MWrongSFXVer                   "\n错误: 默认的 SFX 模块不支持 RAR %d.%d 压缩文件"
MHeadEncMismatch               "\n无法更改已加密压缩文件中的报头加密模式"
MCannotEmail                   "\n无法将文件 %s 通过电子邮件发送"
MCopyrightS                    "\nRAR SFX 压缩文件"
MSHelpCmd                      "\n\n<Commands>"
MSHelpCmdE                     "\n  -x      从压缩文件 (默认) 解压"
MSHelpCmdT                     "\n  -t      测试压缩文件"
MSHelpCmdV                     "\n  -v      详细列出压缩文件的内容"
MRecVolLimit                   "\n常规卷和恢复卷的总数不得超过 %d"
MVolumeNumber                  "卷 %d"
MCannotDelete                  "\n无法删除 %s"
MRecycleFailed                 "\n无法将一些文件和目录移动到回收站"
MCalcCRC                       "\n正在计算校验和"
MTooLargeSFXArc                "\nSFX 压缩文件太大。Windows 无法运行超过 4 GB 的可执行文件。"
MCalcCRCAllVol                 "\n正在计算所有卷的校验和。"
MNotEnoughDisk                 "\n错误: 没有足够的磁盘空间供 %s。"
MNewerRAR                      "\n您可能需要一个新版本的 RAR。"
MUnkEncMethod                  "\n在 %s 中未知的加密方法"
MWrongPassword                 "\n指定的密码不正确。"
MWrongFilePassword             "\n%s 的密码错误"
MAreaDamaged                   "\n有 %d 字节在 %08x %08x处损坏"
MBlocksRecovered               "\n%u 个块已恢复，%u 个块已重新安置"
MRRDamaged                     "\n恢复记录已损坏。"
MTestingRR                     "\n正在测试恢复记录"
MFailed                        "失败"
MIncompatSwitch                "\n%s 不是 RAR %d.x 压缩文件格式支持的参数。"
MSearchDupFiles                "\n正在查找完全相同的文件"
MNumFound                      "%d 已找到。"
MUnknownExtra                  "\n在 %s 里未知的额外字段。"
MCorruptExtra                  "\n损坏的 %s 额外字段在 %s 里。"
MCopyError                     "\n无法复制 %s 到 %s。"
MCopyErrorHint                 "\n您需要解压整个压缩文件来创建文件参考条目。"
MCopyingData                   "\n正在复制数据"
MErrCreateLnkS                 "\n无法创建符号链接 %s"
MErrCreateLnkH                 "\n无法创建硬链接 %s"
MErrLnkTarget                  "\n您需要先解压缩链接目标"
MNeedAdmin                     "\n您可能需要以管理器身份运行 RAR"
MDictOutMem                    "\n没有足够的内存供 %d MB 压缩词典使用，已改为 %d MB。"
MUseSmalllerDict               "\n请使用较小的压缩词典。"
MExtrDictOutMem                "\n没有足够的内存来解压含有 %u GB 压缩字典的压缩文件。"
MSuggest64bit                  "\n必须使用 64-位的 RAR 版本。"
MOpenErrAtime                  "\n您可能需要删除 -tsp 参数，或作为管理员运行 RAR 才能打开此文件。"
MErrReadInfo                   "\n选择“忽略”来仅使用已经读取的文件部分继续处理，选择“全部忽略”来为所有读取错误都这么做，选择“重试”来重复读取操作，选择“退出”来中止操作。"
MErrReadTrunc                  "\n因为读取错误，未完整压缩 %s。\n"
MErrReadCount                  "\n因为读取错误，未完整压缩 %u 文件。"
MDirNameExists                 "\n已存在使用这种名称的目录"
MStdinNoInput                  "\n从 stdin 读取数据时不允许键盘输入"
MTruncPsw                      "\n密码超过 %u 个字符的最大允许长度，将被截断。"
MAdjustValue                   "\n将 %s 值调整到 %s。"
MOpFailed                      "\n操作失败"
MSkipEncArc                    "\n正在跳过加密的压缩文件 %s"
MOrigName                      "原始名称"
MOriginalTime                  "原始时间"
MFileRenamed                   "\n%s 被重命名为 %s"
MDictNotAllowed                "\n%u GB 字典超过 %u GB 限制，而且需要大于 %u GB 内存来解压缩。"
MDictExtrAnyway                "\n使用 -md%ug 或 -mdx%ug 参数来解压缩。"
MDictComprLimit                "\n%u GB 字典超过 %u GB 限制，而且在压缩数据时不被允许。"
MNeedSFX64                     "\n对于 %u GB 压缩字典而言，64-位的自解压模块是必需的。"
MSkipUnsafeLink                "\n正在跳过可能不安全的 %s -> %s 链接。对于来自可信来源的压缩文件，请使用 -ola 来解压缩它。"
MTruncService                  "\n在服务块处截断: %s"
MHeaderQO                      "快速打开信息"
MHeaderRR                      "恢复记录"
MLockInMemoryNeeded            "-mlp 参数需要“在内存锁定页面”权限。您要将其分配给当前用户账户吗?"
MPrivilegeAssigned             "已成功分配用户权限，并将在 Windows 重启后将其激活。要立即重启吗?"
